node {
  name: "serving_default_dense_input"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 10
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 10
        }
      }
    }
  }
}
node {
  name: "dense_2/bias"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
        }
        float_val: -0.675394118
      }
    }
  }
}
node {
  name: "dense_2/kernel"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 50
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dense_1/bias"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 50
          }
        }
      }
    }
  }
}
node {
  name: "dense_1/kernel"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 100
          }
          dim {
            size: 50
          }
        }
      }
    }
  }
}
node {
  name: "dense/bias"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 100
          }
        }
      }
    }
  }
}
node {
  name: "dense/kernel"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 10
          }
          dim {
            size: 100
          }
        }
      }
    }
  }
}
node {
  name: "StatefulPartitionedCall"
  op: "StatefulPartitionedCall"
  input: "serving_default_dense_input"
  input: "dense/kernel"
  input: "dense/bias"
  input: "dense_1/kernel"
  input: "dense_1/bias"
  input: "dense_2/kernel"
  input: "dense_2/bias"
  attr {
    key: "Tin"
    value {
      list {
        type: DT_FLOAT
        type: 20
        type: 20
        type: 20
        type: 20
        type: 20
        type: 20
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "_read_only_resource_inputs"
    value {
      list {
        i: 1
        i: 2
        i: 3
        i: 4
        i: 5
        i: 6
      }
    }
  }
  attr {
    key: "config"
    value {
      s: ""
    }
  }
  attr {
    key: "config_proto"
    value {
      s: "\n\007\n\003GPU\020\000\n\007\n\003CPU\020\0012\002J\0008\001"
    }
  }
  attr {
    key: "executor_type"
    value {
      s: ""
    }
  }
  attr {
    key: "f"
    value {
      func {
        name: "__inference_signature_wrapper_3810"
      }
    }
  }
}
library {
  function {
    signature {
      name: "__inference_sequential_layer_call_fn_3894"
      input_arg {
        name: "inputs"
        type: DT_FLOAT
      }
      input_arg {
        name: "unknown"
        type: 20
      }
      input_arg {
        name: "unknown_0"
        type: 20
      }
      input_arg {
        name: "unknown_1"
        type: 20
      }
      input_arg {
        name: "unknown_2"
        type: 20
      }
      input_arg {
        name: "unknown_3"
        type: 20
      }
      input_arg {
        name: "unknown_4"
        type: 20
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      is_stateful: true
      20: "StatefulPartitionedCall"
    }
    3 {
      1: "StatefulPartitionedCall"
      2: "StatefulPartitionedCall"
      3: "inputs"
      3: "unknown"
      3: "unknown_0"
      3: "unknown_1"
      3: "unknown_2"
      3: "unknown_3"
      3: "unknown_4"
      5 {
        1: "Tin"
        2 {
          1 {
            6: "\001\024\024\024\024\024\024"
          }
        }
      }
      5 {
        1: "Tout"
        2 {
          1 {
            6: "\001"
          }
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 1
              }
            }
          }
        }
      }
      5 {
        1: "_read_only_resource_inputs"
        2 {
          1 {
            3: "\001\002\003\004\005\006"
          }
        }
      }
      5 {
        1: "config_proto"
        2 {
          2 {
            1 {
              1: "GPU"
              2: 0
            }
            1 {
              1: "CPU"
              2: 1
            }
            6 {
              9: ""
            }
            7: 1
          }
        }
      }
      5 {
        1: "f"
        2 {
          10 {
            1: "__inference_sequential_layer_call_and_return_conditional_losses_3768"
          }
        }
      }
      6 {
        1: "StatefulPartitionedCall"
      }
    }
    3 {
      1: "Identity"
      2: "Identity"
      3: "StatefulPartitionedCall:output:0"
      3: "^StatefulPartitionedCall"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 1
              }
            }
          }
        }
      }
      6 {
        1: "Identity"
      }
    }
    4 {
      1: "identity"
      2: "Identity:output:0"
    }
    5 {
      1: "_input_shapes"
      2 {
        1 {
          7 {
            2 {
              1: 18446744073709551615
            }
            2 {
              1: 10
            }
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
        }
      }
    }
    6 {
      1: "StatefulPartitionedCall"
      2: "StatefulPartitionedCall"
    }
    7 {
      1: 0
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7 {
                2 {
                  1: 18446744073709551615
                }
                2 {
                  1: 10
                }
              }
            }
          }
        }
        1 {
          1: "_user_specified_name"
          2 {
            2: "inputs"
          }
        }
      }
    }
    7 {
      1: 1
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 2
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 3
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 4
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 5
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 6
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_dense_layer_call_and_return_conditional_losses_3620"
      input_arg {
        name: "inputs"
        type: DT_FLOAT
      }
      input_arg {
        name: "matmul_readvariableop_resource"
        type: 20
      }
      input_arg {
        name: "biasadd_readvariableop_resource"
        type: 20
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      is_stateful: true
    }
    3 {
      1: "MatMul/ReadVariableOp"
      2: "ReadVariableOp"
      3: "matmul_readvariableop_resource"
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 10
              }
              2 {
                1: 100
              }
            }
          }
        }
      }
      5 {
        1: "dtype"
        2 {
          6: 1
        }
      }
      6 {
        1: "MatMul/ReadVariableOp"
      }
    }
    3 {
      1: "MatMul"
      2: "MatMul"
      3: "inputs"
      3: "MatMul/ReadVariableOp:value:0"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 100
              }
            }
          }
        }
      }
      6 {
        1: "MatMul"
      }
    }
    3 {
      1: "BiasAdd/ReadVariableOp"
      2: "ReadVariableOp"
      3: "biasadd_readvariableop_resource"
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 100
              }
            }
          }
        }
      }
      5 {
        1: "dtype"
        2 {
          6: 1
        }
      }
      6 {
        1: "BiasAdd/ReadVariableOp"
      }
    }
    3 {
      1: "BiasAdd"
      2: "BiasAdd"
      3: "MatMul:product:0"
      3: "BiasAdd/ReadVariableOp:value:0"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 100
              }
            }
          }
        }
      }
      6 {
        1: "BiasAdd"
      }
    }
    3 {
      1: "Relu"
      2: "Relu"
      3: "BiasAdd:output:0"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 100
              }
            }
          }
        }
      }
      6 {
        1: "Relu"
      }
    }
    3 {
      1: "Identity"
      2: "Identity"
      3: "Relu:activations:0"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 100
              }
            }
          }
        }
      }
      6 {
        1: "Identity"
      }
    }
    4 {
      1: "identity"
      2: "Identity:output:0"
    }
    5 {
      1: "_input_shapes"
      2 {
        1 {
          7 {
            2 {
              1: 18446744073709551615
            }
            2 {
              1: 10
            }
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
        }
      }
    }
    7 {
      1: 0
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7 {
                2 {
                  1: 18446744073709551615
                }
                2 {
                  1: 10
                }
              }
            }
          }
        }
        1 {
          1: "_user_specified_name"
          2 {
            2: "inputs"
          }
        }
      }
    }
    7 {
      1: 1
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 2
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_signature_wrapper_3810"
      input_arg {
        name: "dense_input"
        type: DT_FLOAT
      }
      input_arg {
        name: "unknown"
        type: 20
      }
      input_arg {
        name: "unknown_0"
        type: 20
      }
      input_arg {
        name: "unknown_1"
        type: 20
      }
      input_arg {
        name: "unknown_2"
        type: 20
      }
      input_arg {
        name: "unknown_3"
        type: 20
      }
      input_arg {
        name: "unknown_4"
        type: 20
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      is_stateful: true
      20: "StatefulPartitionedCall"
    }
    3 {
      1: "StatefulPartitionedCall"
      2: "StatefulPartitionedCall"
      3: "dense_input"
      3: "unknown"
      3: "unknown_0"
      3: "unknown_1"
      3: "unknown_2"
      3: "unknown_3"
      3: "unknown_4"
      5 {
        1: "Tin"
        2 {
          1 {
            6: "\001\024\024\024\024\024\024"
          }
        }
      }
      5 {
        1: "Tout"
        2 {
          1 {
            6: "\001"
          }
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 1
              }
            }
          }
        }
      }
      5 {
        1: "_read_only_resource_inputs"
        2 {
          1 {
            3: "\001\002\003\004\005\006"
          }
        }
      }
      5 {
        1: "config_proto"
        2 {
          2 {
            1 {
              1: "GPU"
              2: 0
            }
            1 {
              1: "CPU"
              2: 1
            }
            6 {
              9: ""
            }
            7: 1
          }
        }
      }
      5 {
        1: "f"
        2 {
          10 {
            1: "__inference__wrapped_model_3605"
          }
        }
      }
      6 {
        1: "StatefulPartitionedCall"
      }
    }
    3 {
      1: "Identity"
      2: "Identity"
      3: "StatefulPartitionedCall:output:0"
      3: "^StatefulPartitionedCall"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 1
              }
            }
          }
        }
      }
      6 {
        1: "Identity"
      }
    }
    4 {
      1: "identity"
      2: "Identity:output:0"
    }
    5 {
      1: "_input_shapes"
      2 {
        1 {
          7 {
            2 {
              1: 18446744073709551615
            }
            2 {
              1: 10
            }
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
        }
      }
    }
    6 {
      1: "StatefulPartitionedCall"
      2: "StatefulPartitionedCall"
    }
    7 {
      1: 0
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7 {
                2 {
                  1: 18446744073709551615
                }
                2 {
                  1: 10
                }
              }
            }
          }
        }
        1 {
          1: "_user_specified_name"
          2 {
            2: "dense_input"
          }
        }
      }
    }
    7 {
      1: 1
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 2
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 3
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 4
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 5
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 6
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_sequential_layer_call_and_return_conditional_losses_3860"
      input_arg {
        name: "inputs"
        type: DT_FLOAT
      }
      input_arg {
        name: "dense_matmul_readvariableop_resource"
        type: 20
      }
      input_arg {
        name: "dense_biasadd_readvariableop_resource"
        type: 20
      }
      input_arg {
        name: "dense_1_matmul_readvariableop_resource"
        type: 20
      }
      input_arg {
        name: "dense_1_biasadd_readvariableop_resource"
        type: 20
      }
      input_arg {
        name: "dense_2_matmul_readvariableop_resource"
        type: 20
      }
      input_arg {
        name: "dense_2_biasadd_readvariableop_resource"
        type: 20
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      is_stateful: true
    }
    3 {
      1: "dense/MatMul/ReadVariableOp"
      2: "ReadVariableOp"
      3: "dense_matmul_readvariableop_resource"
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 10
              }
              2 {
                1: 100
              }
            }
          }
        }
      }
      5 {
        1: "dtype"
        2 {
          6: 1
        }
      }
      6 {
        1: "dense/MatMul/ReadVariableOp"
      }
    }
    3 {
      1: "dense/MatMul"
      2: "MatMul"
      3: "inputs"
      3: "dense/MatMul/ReadVariableOp:value:0"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 100
              }
            }
          }
        }
      }
      6 {
        1: "dense/MatMul"
      }
    }
    3 {
      1: "dense/BiasAdd/ReadVariableOp"
      2: "ReadVariableOp"
      3: "dense_biasadd_readvariableop_resource"
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 100
              }
            }
          }
        }
      }
      5 {
        1: "dtype"
        2 {
          6: 1
        }
      }
      6 {
        1: "dense/BiasAdd/ReadVariableOp"
      }
    }
    3 {
      1: "dense/BiasAdd"
      2: "BiasAdd"
      3: "dense/MatMul:product:0"
      3: "dense/BiasAdd/ReadVariableOp:value:0"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 100
              }
            }
          }
        }
      }
      6 {
        1: "dense/BiasAdd"
      }
    }
    3 {
      1: "dense/Relu"
      2: "Relu"
      3: "dense/BiasAdd:output:0"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 100
              }
            }
          }
        }
      }
      6 {
        1: "dense/Relu"
      }
    }
    3 {
      1: "dense_1/MatMul/ReadVariableOp"
      2: "ReadVariableOp"
      3: "dense_1_matmul_readvariableop_resource"
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 100
              }
              2 {
                1: 50
              }
            }
          }
        }
      }
      5 {
        1: "dtype"
        2 {
          6: 1
        }
      }
      6 {
        1: "dense_1/MatMul/ReadVariableOp"
      }
    }
    3 {
      1: "dense_1/MatMul"
      2: "MatMul"
      3: "dense/Relu:activations:0"
      3: "dense_1/MatMul/ReadVariableOp:value:0"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 50
              }
            }
          }
        }
      }
      6 {
        1: "dense_1/MatMul"
      }
    }
    3 {
      1: "dense_1/BiasAdd/ReadVariableOp"
      2: "ReadVariableOp"
      3: "dense_1_biasadd_readvariableop_resource"
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 50
              }
            }
          }
        }
      }
      5 {
        1: "dtype"
        2 {
          6: 1
        }
      }
      6 {
        1: "dense_1/BiasAdd/ReadVariableOp"
      }
    }
    3 {
      1: "dense_1/BiasAdd"
      2: "BiasAdd"
      3: "dense_1/MatMul:product:0"
      3: "dense_1/BiasAdd/ReadVariableOp:value:0"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 50
              }
            }
          }
        }
      }
      6 {
        1: "dense_1/BiasAdd"
      }
    }
    3 {
      1: "dense_1/Relu"
      2: "Relu"
      3: "dense_1/BiasAdd:output:0"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 50
              }
            }
          }
        }
      }
      6 {
        1: "dense_1/Relu"
      }
    }
    3 {
      1: "dense_2/MatMul/ReadVariableOp"
      2: "ReadVariableOp"
      3: "dense_2_matmul_readvariableop_resource"
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 50
              }
              2 {
                1: 1
              }
            }
          }
        }
      }
      5 {
        1: "dtype"
        2 {
          6: 1
        }
      }
      6 {
        1: "dense_2/MatMul/ReadVariableOp"
      }
    }
    3 {
      1: "dense_2/MatMul"
      2: "MatMul"
      3: "dense_1/Relu:activations:0"
      3: "dense_2/MatMul/ReadVariableOp:value:0"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 1
              }
            }
          }
        }
      }
      6 {
        1: "dense_2/MatMul"
      }
    }
    3 {
      1: "dense_2/BiasAdd/ReadVariableOp"
      2: "ReadVariableOp"
      3: "dense_2_biasadd_readvariableop_resource"
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 1
              }
            }
          }
        }
      }
      5 {
        1: "dtype"
        2 {
          6: 1
        }
      }
      6 {
        1: "dense_2/BiasAdd/ReadVariableOp"
      }
    }
    3 {
      1: "dense_2/BiasAdd"
      2: "BiasAdd"
      3: "dense_2/MatMul:product:0"
      3: "dense_2/BiasAdd/ReadVariableOp:value:0"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 1
              }
            }
          }
        }
      }
      6 {
        1: "dense_2/BiasAdd"
      }
    }
    3 {
      1: "dense_2/Sigmoid"
      2: "Sigmoid"
      3: "dense_2/BiasAdd:output:0"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 1
              }
            }
          }
        }
      }
      6 {
        1: "dense_2/Sigmoid"
      }
    }
    3 {
      1: "Identity"
      2: "Identity"
      3: "dense_2/Sigmoid:y:0"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 1
              }
            }
          }
        }
      }
      6 {
        1: "Identity"
      }
    }
    4 {
      1: "identity"
      2: "Identity:output:0"
    }
    5 {
      1: "_input_shapes"
      2 {
        1 {
          7 {
            2 {
              1: 18446744073709551615
            }
            2 {
              1: 10
            }
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
        }
      }
    }
    7 {
      1: 0
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7 {
                2 {
                  1: 18446744073709551615
                }
                2 {
                  1: 10
                }
              }
            }
          }
        }
        1 {
          1: "_user_specified_name"
          2 {
            2: "inputs"
          }
        }
      }
    }
    7 {
      1: 1
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 2
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 3
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 4
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 5
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 6
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_sequential_layer_call_and_return_conditional_losses_3710"
      input_arg {
        name: "dense_input"
        type: DT_FLOAT
      }
      input_arg {
        name: "dense_3694"
        type: 20
      }
      input_arg {
        name: "dense_3696"
        type: 20
      }
      input_arg {
        name: "dense_1_3699"
        type: 20
      }
      input_arg {
        name: "dense_1_3701"
        type: 20
      }
      input_arg {
        name: "dense_2_3704"
        type: 20
      }
      input_arg {
        name: "dense_2_3706"
        type: 20
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      is_stateful: true
      20: "dense/StatefulPartitionedCall"
      20: "dense_1/StatefulPartitionedCall"
      20: "dense_2/StatefulPartitionedCall"
    }
    3 {
      1: "dense/StatefulPartitionedCall"
      2: "StatefulPartitionedCall"
      3: "dense_input"
      3: "dense_3694"
      3: "dense_3696"
      5 {
        1: "Tin"
        2 {
          1 {
            6: "\001\024\024"
          }
        }
      }
      5 {
        1: "Tout"
        2 {
          1 {
            6: "\001"
          }
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 100
              }
            }
          }
        }
      }
      5 {
        1: "_read_only_resource_inputs"
        2 {
          1 {
            3: "\001\002"
          }
        }
      }
      5 {
        1: "config_proto"
        2 {
          2 {
            1 {
              1: "GPU"
              2: 0
            }
            1 {
              1: "CPU"
              2: 1
            }
            6 {
              9: ""
            }
            7: 1
          }
        }
      }
      5 {
        1: "f"
        2 {
          10 {
            1: "__inference_dense_layer_call_and_return_conditional_losses_3620"
          }
        }
      }
      6 {
        1: "dense/StatefulPartitionedCall"
      }
    }
    3 {
      1: "dense_1/StatefulPartitionedCall"
      2: "StatefulPartitionedCall"
      3: "dense/StatefulPartitionedCall:output:0"
      3: "dense_1_3699"
      3: "dense_1_3701"
      5 {
        1: "Tin"
        2 {
          1 {
            6: "\001\024\024"
          }
        }
      }
      5 {
        1: "Tout"
        2 {
          1 {
            6: "\001"
          }
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 50
              }
            }
          }
        }
      }
      5 {
        1: "_read_only_resource_inputs"
        2 {
          1 {
            3: "\001\002"
          }
        }
      }
      5 {
        1: "config_proto"
        2 {
          2 {
            1 {
              1: "GPU"
              2: 0
            }
            1 {
              1: "CPU"
              2: 1
            }
            6 {
              9: ""
            }
            7: 1
          }
        }
      }
      5 {
        1: "f"
        2 {
          10 {
            1: "__inference_dense_1_layer_call_and_return_conditional_losses_3647"
          }
        }
      }
      6 {
        1: "dense_1/StatefulPartitionedCall"
      }
    }
    3 {
      1: "dense_2/StatefulPartitionedCall"
      2: "StatefulPartitionedCall"
      3: "dense_1/StatefulPartitionedCall:output:0"
      3: "dense_2_3704"
      3: "dense_2_3706"
      5 {
        1: "Tin"
        2 {
          1 {
            6: "\001\024\024"
          }
        }
      }
      5 {
        1: "Tout"
        2 {
          1 {
            6: "\001"
          }
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 1
              }
            }
          }
        }
      }
      5 {
        1: "_read_only_resource_inputs"
        2 {
          1 {
            3: "\001\002"
          }
        }
      }
      5 {
        1: "config_proto"
        2 {
          2 {
            1 {
              1: "GPU"
              2: 0
            }
            1 {
              1: "CPU"
              2: 1
            }
            6 {
              9: ""
            }
            7: 1
          }
        }
      }
      5 {
        1: "f"
        2 {
          10 {
            1: "__inference_dense_2_layer_call_and_return_conditional_losses_3674"
          }
        }
      }
      6 {
        1: "dense_2/StatefulPartitionedCall"
      }
    }
    3 {
      1: "Identity"
      2: "Identity"
      3: "dense_2/StatefulPartitionedCall:output:0"
      3: "^dense/StatefulPartitionedCall"
      3: "^dense_1/StatefulPartitionedCall"
      3: "^dense_2/StatefulPartitionedCall"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 1
              }
            }
          }
        }
      }
      6 {
        1: "Identity"
      }
    }
    4 {
      1: "identity"
      2: "Identity:output:0"
    }
    5 {
      1: "_input_shapes"
      2 {
        1 {
          7 {
            2 {
              1: 18446744073709551615
            }
            2 {
              1: 10
            }
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
        }
      }
    }
    6 {
      1: "dense/StatefulPartitionedCall"
      2: "dense/StatefulPartitionedCall"
    }
    6 {
      1: "dense_1/StatefulPartitionedCall"
      2: "dense_1/StatefulPartitionedCall"
    }
    6 {
      1: "dense_2/StatefulPartitionedCall"
      2: "dense_2/StatefulPartitionedCall"
    }
    7 {
      1: 0
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7 {
                2 {
                  1: 18446744073709551615
                }
                2 {
                  1: 10
                }
              }
            }
          }
        }
        1 {
          1: "_user_specified_name"
          2 {
            2: "dense_input"
          }
        }
      }
    }
    7 {
      1: 1
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 2
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 3
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 4
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 5
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 6
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_sequential_layer_call_and_return_conditional_losses_3768"
      input_arg {
        name: "inputs"
        type: DT_FLOAT
      }
      input_arg {
        name: "dense_3752"
        type: 20
      }
      input_arg {
        name: "dense_3754"
        type: 20
      }
      input_arg {
        name: "dense_1_3757"
        type: 20
      }
      input_arg {
        name: "dense_1_3759"
        type: 20
      }
      input_arg {
        name: "dense_2_3762"
        type: 20
      }
      input_arg {
        name: "dense_2_3764"
        type: 20
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      is_stateful: true
      20: "dense/StatefulPartitionedCall"
      20: "dense_1/StatefulPartitionedCall"
      20: "dense_2/StatefulPartitionedCall"
    }
    3 {
      1: "dense/StatefulPartitionedCall"
      2: "StatefulPartitionedCall"
      3: "inputs"
      3: "dense_3752"
      3: "dense_3754"
      5 {
        1: "Tin"
        2 {
          1 {
            6: "\001\024\024"
          }
        }
      }
      5 {
        1: "Tout"
        2 {
          1 {
            6: "\001"
          }
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 100
              }
            }
          }
        }
      }
      5 {
        1: "_read_only_resource_inputs"
        2 {
          1 {
            3: "\001\002"
          }
        }
      }
      5 {
        1: "config_proto"
        2 {
          2 {
            1 {
              1: "GPU"
              2: 0
            }
            1 {
              1: "CPU"
              2: 1
            }
            6 {
              9: ""
            }
            7: 1
          }
        }
      }
      5 {
        1: "f"
        2 {
          10 {
            1: "__inference_dense_layer_call_and_return_conditional_losses_3620"
          }
        }
      }
      6 {
        1: "dense/StatefulPartitionedCall"
      }
    }
    3 {
      1: "dense_1/StatefulPartitionedCall"
      2: "StatefulPartitionedCall"
      3: "dense/StatefulPartitionedCall:output:0"
      3: "dense_1_3757"
      3: "dense_1_3759"
      5 {
        1: "Tin"
        2 {
          1 {
            6: "\001\024\024"
          }
        }
      }
      5 {
        1: "Tout"
        2 {
          1 {
            6: "\001"
          }
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 50
              }
            }
          }
        }
      }
      5 {
        1: "_read_only_resource_inputs"
        2 {
          1 {
            3: "\001\002"
          }
        }
      }
      5 {
        1: "config_proto"
        2 {
          2 {
            1 {
              1: "GPU"
              2: 0
            }
            1 {
              1: "CPU"
              2: 1
            }
            6 {
              9: ""
            }
            7: 1
          }
        }
      }
      5 {
        1: "f"
        2 {
          10 {
            1: "__inference_dense_1_layer_call_and_return_conditional_losses_3647"
          }
        }
      }
      6 {
        1: "dense_1/StatefulPartitionedCall"
      }
    }
    3 {
      1: "dense_2/StatefulPartitionedCall"
      2: "StatefulPartitionedCall"
      3: "dense_1/StatefulPartitionedCall:output:0"
      3: "dense_2_3762"
      3: "dense_2_3764"
      5 {
        1: "Tin"
        2 {
          1 {
            6: "\001\024\024"
          }
        }
      }
      5 {
        1: "Tout"
        2 {
          1 {
            6: "\001"
          }
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 1
              }
            }
          }
        }
      }
      5 {
        1: "_read_only_resource_inputs"
        2 {
          1 {
            3: "\001\002"
          }
        }
      }
      5 {
        1: "config_proto"
        2 {
          2 {
            1 {
              1: "GPU"
              2: 0
            }
            1 {
              1: "CPU"
              2: 1
            }
            6 {
              9: ""
            }
            7: 1
          }
        }
      }
      5 {
        1: "f"
        2 {
          10 {
            1: "__inference_dense_2_layer_call_and_return_conditional_losses_3674"
          }
        }
      }
      6 {
        1: "dense_2/StatefulPartitionedCall"
      }
    }
    3 {
      1: "Identity"
      2: "Identity"
      3: "dense_2/StatefulPartitionedCall:output:0"
      3: "^dense/StatefulPartitionedCall"
      3: "^dense_1/StatefulPartitionedCall"
      3: "^dense_2/StatefulPartitionedCall"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 1
              }
            }
          }
        }
      }
      6 {
        1: "Identity"
      }
    }
    4 {
      1: "identity"
      2: "Identity:output:0"
    }
    5 {
      1: "_input_shapes"
      2 {
        1 {
          7 {
            2 {
              1: 18446744073709551615
            }
            2 {
              1: 10
            }
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
        }
      }
    }
    6 {
      1: "dense/StatefulPartitionedCall"
      2: "dense/StatefulPartitionedCall"
    }
    6 {
      1: "dense_1/StatefulPartitionedCall"
      2: "dense_1/StatefulPartitionedCall"
    }
    6 {
      1: "dense_2/StatefulPartitionedCall"
      2: "dense_2/StatefulPartitionedCall"
    }
    7 {
      1: 0
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7 {
                2 {
                  1: 18446744073709551615
                }
                2 {
                  1: 10
                }
              }
            }
          }
        }
        1 {
          1: "_user_specified_name"
          2 {
            2: "inputs"
          }
        }
      }
    }
    7 {
      1: 1
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 2
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 3
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 4
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 5
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 6
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_sequential_layer_call_fn_3783"
      input_arg {
        name: "dense_input"
        type: DT_FLOAT
      }
      input_arg {
        name: "unknown"
        type: 20
      }
      input_arg {
        name: "unknown_0"
        type: 20
      }
      input_arg {
        name: "unknown_1"
        type: 20
      }
      input_arg {
        name: "unknown_2"
        type: 20
      }
      input_arg {
        name: "unknown_3"
        type: 20
      }
      input_arg {
        name: "unknown_4"
        type: 20
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      is_stateful: true
      20: "StatefulPartitionedCall"
    }
    3 {
      1: "StatefulPartitionedCall"
      2: "StatefulPartitionedCall"
      3: "dense_input"
      3: "unknown"
      3: "unknown_0"
      3: "unknown_1"
      3: "unknown_2"
      3: "unknown_3"
      3: "unknown_4"
      5 {
        1: "Tin"
        2 {
          1 {
            6: "\001\024\024\024\024\024\024"
          }
        }
      }
      5 {
        1: "Tout"
        2 {
          1 {
            6: "\001"
          }
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 1
              }
            }
          }
        }
      }
      5 {
        1: "_read_only_resource_inputs"
        2 {
          1 {
            3: "\001\002\003\004\005\006"
          }
        }
      }
      5 {
        1: "config_proto"
        2 {
          2 {
            1 {
              1: "GPU"
              2: 0
            }
            1 {
              1: "CPU"
              2: 1
            }
            6 {
              9: ""
            }
            7: 1
          }
        }
      }
      5 {
        1: "f"
        2 {
          10 {
            1: "__inference_sequential_layer_call_and_return_conditional_losses_3768"
          }
        }
      }
      6 {
        1: "StatefulPartitionedCall"
      }
    }
    3 {
      1: "Identity"
      2: "Identity"
      3: "StatefulPartitionedCall:output:0"
      3: "^StatefulPartitionedCall"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 1
              }
            }
          }
        }
      }
      6 {
        1: "Identity"
      }
    }
    4 {
      1: "identity"
      2: "Identity:output:0"
    }
    5 {
      1: "_input_shapes"
      2 {
        1 {
          7 {
            2 {
              1: 18446744073709551615
            }
            2 {
              1: 10
            }
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
          7 {
            3: 1
          }
        }
      }
    }
    6 {
      1: "StatefulPartitionedCall"
      2: "StatefulPartitionedCall"
    }
    7 {
      1: 0
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7 {
                2 {
                  1: 18446744073709551615
                }
                2 {
                  1: 10
                }
              }
            }
          }
        }
        1 {
          1: "_user_specified_name"
          2 {
            2: "dense_input"
          }
        }
      }
    }
    7 {
      1: 1
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 2
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 3
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 4
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 5
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
    7 {
      1: 6
      2 {
        1 {
          1: "_output_shapes"
          2 {
            1 {
              7: ""
            }
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_dense_2_layer_call_and_return_conditional_losses_3674"
      input_arg {
        name: "inputs"
        type: DT_FLOAT
      }
      input_arg {
        name: "matmul_readvariableop_resource"
        type: 20
      }
      input_arg {
        name: "biasadd_readvariableop_resource"
        type: 20
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      is_stateful: true
    }
    3 {
      1: "MatMul/ReadVariableOp"
      2: "ReadVariableOp"
      3: "matmul_readvariableop_resource"
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 50
              }
              2 {
                1: 1
              }
            }
          }
        }
      }
      5 {
        1: "dtype"
        2 {
          6: 1
        }
      }
      6 {
        1: "MatMul/ReadVariableOp"
      }
    }
    3 {
      1: "MatMul"
      2: "MatMul"
      3: "inputs"
      3: "MatMul/ReadVariableOp:value:0"
      5 {
        1: "T"
        2 {
          6: 1
        }
      }
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 18446744073709551615
              }
              2 {
                1: 1
              }
            }
          }
        }
      }
      6 {
        1: "MatMul"
      }
    }
    3 {
      1: "BiasAdd/ReadVariableOp"
      2: "ReadVariableOp"
      3: "biasadd_readvariableop_resource"
      5 {
        1: "_output_shapes"
        2 {
          1 {
            7 {
              2 {
                1: 1
              }
            }
          }
        }
      }
      5 {
        1: "dtype"
        2 {
          6: 1
        }
      }
      6 {
        1: "BiasAdd/ReadVariableOp"
      }
    }
    3 {
